model {
  ssd {
    inplace_batchnorm_update: true
    freeze_batchnorm: false
    num_classes: 2

    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }

    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: true
      }
    }

    similarity_calculator {
      iou_similarity {
      }
    }

    encode_background_as_zeros: true
    anchor_generator {
      multiscale_anchor_generator {
        min_level: 3
        max_level: 7
        anchor_scale: 4.0
        aspect_ratios: [1.0, 2.0, 0.5]
        scales_per_octave: 2
      }
    }

    image_resizer {
      fixed_shape_resizer {
        height: 640
        width: 640
      }
    }

    box_predictor {
      weight_shared_convolutional_box_predictor {
        depth: 256
        class_prediction_bias_init: -4.6

        conv_hyperparams {
          activation: RELU_6,
          regularizer {
            l2_regularizer {
              weight: 0.0004
            }
          }
          initializer {
            random_normal_initializer {
              mean: 0.0
              stddev: 0.01
            }
          }
          batch_norm {
            decay: 0.997,
            scale: true,
            epsilon: 0.00,
          }
        }
        num_layers_before_predictor: 4
        kernel_size: 1
      }
    }

    feature_extractor {
      type: "ssd_resnet152_v1_fpn"
      fpn {
        min_level: 3
        max_level: 7
      }
      depth_multiplier: 1.0
      min_depth: 16
      pad_to_multiple: 32
      conv_hyperparams {
        activation: RELU_6,
        regularizer {
          l2_regularizer {
            weight: 0.0004
          }
        }
        initializer {
          truncated_normal_initializer {
            mean: 0.0
            stddev: 0.03
          }
        }
        batch_norm {
          decay: 0.997
          scale: true
          epsilon: 0.001
        }
      }
      override_base_feature_extractor_hyperparams: true
    }

    loss {
      classification_loss {
        weighted_sigmoid_focal {
                gamma: 2.0
                alpha: 0.25
        }
      }
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_weight: 1.0
      localization_weight: 2.0
    }

    normalize_loss_by_num_matches: true
    normalize_loc_loss_by_codesize: true

    post_processing {
      batch_non_max_suppression {
        # Need to tune this also
        score_threshold: 1e-8
        iou_threshold: 0.5
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
  }
}

train_config: {
  batch_size: 16
  sync_replicas: true
  num_steps: 25000
  startup_delay_steps: 0.0
  replicas_to_aggregate: 8

  data_augmentation_options {
    random_horizontal_flip {
    }
  }

  data_augmentation_options {
    random_crop_image {
      min_object_covered: 0.0
      min_aspect_ratio: 0.75
      max_aspect_ratio: 3.0
      min_area: 0.75
      max_area: 1.0
      overlap_thresh: 0.0
    }
  }
    optimizer {
    momentum_optimizer {
      learning_rate {
        cosine_decay_learning_rate {
          learning_rate_base: 0.04
          total_steps: 20000
          warmup_learning_rate: 0.0133334
          warmup_steps: 160
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false

}

train_input_reader: {
  tf_record_input_reader {
    input_path: "../input/hackathon_train.tfrecord"
  }
  label_map_path: "../input/label_map.pbtxt"
}

eval_config: {
  num_examples: 500
  # Note: The below line limits the evaluation process to 10 evaluations.
  # Remove the below line to evaluate indefinitely.
  max_evals: 50
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "../input/hackathon_val.tfrecord"
  }
  label_map_path: "../input/label_map.pbtxt"
  shuffle: false
  num_readers: 1
}